---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MEPAnalyticalNode.Location
source: html/1b53744e-d015-a2eb-126a-17e57b77078b.htm
---
# Autodesk.Revit.DB.Analysis.MEPAnalyticalNode.Location Property

The location of this node.

## Syntax (C#)
```csharp
public XYZ Location { get; }
```